In [1]:
import pandas as pd

In [2]:
names = ['Bob','Jessica','Mary','John','Mel']
births = [968, 155, 77, 578, 973]

In [3]:
BabyDataSet = list(zip(names,births))

In [4]:
df = pd.DataFrame(data = BabyDataSet, columns=['Names', 'Births'])

In [5]:
df

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

In [6]:
df.to_csv('births1880.csv',index=False,header=False)

In [7]:
df = pd.read_csv('births1880.csv')

In [8]:
df

       Bob  968
0  Jessica  155
1     Mary   77
2     John  578
3      Mel  973

In [9]:
df = pd.read_csv('births1880.csv',header = None)

In [10]:
df

         0    1
0      Bob  968
1  Jessica  155
2     Mary   77
3     John  578
4      Mel  973

In [11]:
df = pd.read_csv('births1880.csv', names=['Names','Births'])

In [12]:
df

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

In [13]:
import os
os.remove('births1880.csv')

In [14]:
df.dtypes

Names     object
Births     int64
dtype: object

In [15]:
df.Names.dtype

dtype('O')

In [18]:
Sorted = df.sort_values(['Births'],ascending=False)
Sorted.head(1)

  Names  Births
4   Mel     973

In [20]:
df['Births'].max()

973

In [23]:
import matplotlib.pyplot as plt

df['Births'].plot()

MaxValue = df['Births'].max()

MaxName = df['Names'][df['Births'] == df['Births'].max()].values

Text = str(MaxValue) + " - " + MaxName

plt.annotate(Text, xy=(1, MaxValue), xytext=(8, 0),xycoords=('axes fraction', 'data'), textcoords='offset points')

print("The most popular name")
df[df['Births'] == df['Births'].max()]

The most popular name

  Names  Births
4   Mel     973